In [99]:
import numpy as np
import pandas as pd

In [100]:
data1 = {"ID" : ["A", "A", "A", "B", "B"],
         "year" : [2014, 2015, 2016, 2015, 2016],
         "credits" : [100, 200, 250, 150, 140]}

In [101]:
data1

{'ID': ['A', 'A', 'A', 'B', 'B'],
 'credits': [100, 200, 250, 150, 140],
 'year': [2014, 2015, 2016, 2015, 2016]}

In [102]:
df1 = pd.DataFrame(data1, columns=["year", "ID", "credits", "penalty"],
                          index =["one", "two", "three", "four", "five"])

In [103]:
df1

       year ID  credits penalty
one    2014  A      100     NaN
two    2015  A      200     NaN
three  2016  A      250     NaN
four   2015  B      150     NaN
five   2016  B      140     NaN

In [104]:
df1["year"] # result is series format

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [105]:
df1.year  # same result above

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [106]:
df1[["year", "credits"]]

       year  credits
one    2014      100
two    2015      200
three  2016      250
four   2015      150
five   2016      140

In [107]:
df1["penalty"] = [0.1, 0.2, 0.3, 0.4, 0.5]; df1

       year ID  credits  penalty
one    2014  A      100      0.1
two    2015  A      200      0.2
three  2016  A      250      0.3
four   2015  B      150      0.4
five   2016  B      140      0.5

In [108]:
df1["extra"] = np.arange(5); df1

       year ID  credits  penalty  extra
one    2014  A      100      0.1      0
two    2015  A      200      0.2      1
three  2016  A      250      0.3      2
four   2015  B      150      0.4      3
five   2016  B      140      0.5      4

In [109]:
value = pd.Series([10, 20, 30], index=["two", "four", "one"])

In [110]:
df1["points"] = value; df1

       year ID  credits  penalty  extra  points
one    2014  A      100      0.1      0    30.0
two    2015  A      200      0.2      1    10.0
three  2016  A      250      0.3      2     NaN
four   2015  B      150      0.4      3    20.0
five   2016  B      140      0.5      4     NaN

In [111]:
df1["total"] = df1["credits"] - df1["penalty"]; df1

       year ID  credits  penalty  extra  points  total
one    2014  A      100      0.1      0    30.0   99.9
two    2015  A      200      0.2      1    10.0  199.8
three  2016  A      250      0.3      2     NaN  249.7
four   2015  B      150      0.4      3    20.0  149.6
five   2016  B      140      0.5      4     NaN  139.5

In [112]:
del df1["extra"] ; df1

       year ID  credits  penalty  points  total
one    2014  A      100      0.1    30.0   99.9
two    2015  A      200      0.2    10.0  199.8
three  2016  A      250      0.3     NaN  249.7
four   2015  B      150      0.4    20.0  149.6
five   2016  B      140      0.5     NaN  139.5

In [113]:
df1.columns

Index(['year', 'ID', 'credits', 'penalty', 'points', 'total'], dtype='object')

In [114]:
df1.index.name = "Order"
df1.columns.name="Info"; df1

Info   year ID  credits  penalty  points  total
Order
one    2014  A      100      0.1    30.0   99.9
two    2015  A      200      0.2    10.0  199.8
three  2016  A      250      0.3     NaN  249.7
four   2015  B      150      0.4    20.0  149.6
five   2016  B      140      0.5     NaN  139.5

In [115]:
df1[0:3]; df1

Info   year ID  credits  penalty  points  total
Order
one    2014  A      100      0.1    30.0   99.9
two    2015  A      200      0.2    10.0  199.8
three  2016  A      250      0.3     NaN  249.7
four   2015  B      150      0.4    20.0  149.6
five   2016  B      140      0.5     NaN  139.5

In [116]:
df1.loc["two"] # series format

Info
year        2015
ID             A
credits      200
penalty      0.2
points        10
total      199.8
Name: two, dtype: object

In [117]:
df1.loc["two": "four"]

Info   year ID  credits  penalty  points  total
Order
two    2015  A      200      0.2    10.0  199.8
three  2016  A      250      0.3     NaN  249.7
four   2015  B      150      0.4    20.0  149.6

In [118]:
df1.loc["two":"four", "credits"]

Order
two      200
three    250
four     150
Name: credits, dtype: int64

In [130]:
df1.loc[:, "year"]

Order
one      2014.0
two      2015.0
three    2016.0
four     2015.0
five     2016.0
six         NaN
Name: year, dtype: float64

In [131]:
df1["year"]

Order
one      2014.0
two      2015.0
three    2016.0
four     2015.0
five     2016.0
six         NaN
Name: year, dtype: float64

In [132]:
df1.loc[:, ["year", "ID"]]

Info     year   ID
Order
one    2014.0    A
two    2015.0    A
three  2016.0    A
four   2015.0    B
five   2016.0    B
six       NaN  NaN

In [133]:
df1.loc["one":"three", "year":"penalty"]

Info     year ID  credits  penalty
Order
one    2014.0  A    100.0      0.1
two    2015.0  A    200.0      0.2
three  2016.0  A    250.0      0.3

In [134]:
df1

Info     year   ID  credits  penalty  points  total
Order
one    2014.0    A    100.0      0.1    30.0   99.9
two    2015.0    A    200.0      0.2    10.0  199.8
three  2016.0    A    250.0      0.3     NaN  249.7
four   2015.0    B    150.0      0.4    20.0  149.6
five   2016.0    B    140.0      0.5     NaN  139.5
six       NaN  NaN      NaN      NaN     NaN    NaN

In [135]:
df1["year"] > 2014 # called mask

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [136]:
df1.loc[df1["year"] > 2014, :]

Info     year ID  credits  penalty  points  total
Order
two    2015.0  A    200.0      0.2    10.0  199.8
three  2016.0  A    250.0      0.3     NaN  249.7
four   2015.0  B    150.0      0.4    20.0  149.6
five   2016.0  B    140.0      0.5     NaN  139.5

In [137]:
df1.loc[df1["ID"] == "B", ["ID", "credits"]]

Info  ID  credits
Order
four   B    150.0
five   B    140.0

In [138]:
df1.loc[ (df1["credits"] > 130) & (df1["credits"] < 220), :]

Info     year ID  credits  penalty  points  total
Order
two    2015.0  A    200.0      0.2    10.0  199.8
four   2015.0  B    150.0      0.4    20.0  149.6
five   2016.0  B    140.0      0.5     NaN  139.5

In [139]:
df1

Info     year   ID  credits  penalty  points  total
Order
one    2014.0    A    100.0      0.1    30.0   99.9
two    2015.0    A    200.0      0.2    10.0  199.8
three  2016.0    A    250.0      0.3     NaN  249.7
four   2015.0    B    150.0      0.4    20.0  149.6
five   2016.0    B    140.0      0.5     NaN  139.5
six       NaN  NaN      NaN      NaN     NaN    NaN

In [140]:
df1.iloc[3:5, 0:2]

Info     year ID
Order
four   2015.0  B
five   2016.0  B

In [141]:
df1.iloc[3]

Info
year        2015
ID             B
credits      150
penalty      0.4
points        20
total      149.6
Name: four, dtype: object

In [142]:
df1.iloc[2:4, 0:2]

Info     year ID
Order
three  2016.0  A
four   2015.0  B

In [143]:
df1.loc["three":"four", "year":"ID"]

Info     year ID
Order
three  2016.0  A
four   2015.0  B